#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl
module.vehicles_app_service.module.vehicles_app_service_autoscaler.data.azurerm_linux_web_app.this[0]: Still reading... [10s elapsed]
module.payments_app_service.module.payments_app_service_autoscaler.data.azurerm_linux_web_app.this[0]: Still reading... [10s elapsed]
module.practices_app_service.module.practices_app_service_autoscaler.data.azurerm_linux_web_app.this[0]: Still reading... [10s elapsed]
module.licences_app_service.module.licences_app_service_autoscaler.data.azurerm_linux_web_app.this[0]: Still reading... [10s elapsed]
module.vehicles_app_service.module.vehicles_app_service_autoscaler.data.azurerm_linux_web_app.this[0]: Still reading... [20s elapsed]
module.payments_app_service.module.payments_app_service_autoscaler.data.azurerm_linux_web_app.this[0]: Still reading... [20s elapsed]
module.practices_app_service.module.practices_app_service_autoscaler.data.azurerm_linux_web_app.this[0]: Still reading... [20s elapsed]
module.licences_app_service.module.licences_app_service_autoscaler.data.azurerm_linux_web_app.this[0]: Still reading... [20s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.payments_app_service.module.payments_app_service_autoscaler.azurerm_monitor_autoscale_setting.this will be created
  + resource "azurerm_monitor_autoscale_setting" "this" {
      + enabled             = true
      + id                  = (known after apply)
      + location            = "italynorth"
      + name                = "io-p-itn-ipatente-payments-as-01"
      + resource_group_name = "io-p-itn-ipatente-rg-01"
      + tags                = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-ipatente/infra/prod"
        }
      + target_resource_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-ipatente-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-ipatente-payments-asp-01"

      + profile {
          + name = "Default"

          + capacity {
              + default = 3
              + maximum = 30
              + minimum = 3
            }

          + rule {
              + metric_trigger {
                  + divide_by_instance_count = true
                  + metric_name              = "Requests"
                  + metric_namespace         = "microsoft.web/sites"
                  + metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-ipatente-rg-01/providers/Microsoft.Web/sites/io-p-itn-ipatente-payments-app-01"
                  + operator                 = "GreaterThan"
                  + statistic                = "Average"
                  + threshold                = 3000
                  + time_aggregation         = "Average"
                  + time_grain               = "PT1M"
                  + time_window              = "PT1M"
                }
              + scale_action {
                  + cooldown  = "PT1M"
                  + direction = "Increase"
                  + type      = "ChangeCount"
                  + value     = 2
                }
            }
          + rule {
              + metric_trigger {
                  + divide_by_instance_count = true
                  + metric_name              = "Requests"
                  + metric_namespace         = "microsoft.web/sites"
                  + metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-ipatente-rg-01/providers/Microsoft.Web/sites/io-p-itn-ipatente-payments-app-01"
                  + operator                 = "LessThan"
                  + statistic                = "Average"
                  + threshold                = 2000
                  + time_aggregation         = "Average"
                  + time_grain               = "PT1M"
                  + time_window              = "PT7M"
                }
              + scale_action {
                  + cooldown  = "PT5M"
                  + direction = "Decrease"
                  + type      = "ChangeCount"
                  + value     = 1
                }
            }
          + rule {
              + metric_trigger {
                  + divide_by_instance_count = false
                  + metric_name              = "CpuPercentage"
                  + metric_namespace         = "microsoft.web/serverfarms"
                  + metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-ipatente-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-ipatente-payments-asp-01"
                  + operator                 = "GreaterThan"
                  + statistic                = "Average"
                  + threshold                = 60
                  + time_aggregation         = "Average"
                  + time_grain               = "PT1M"
                  + time_window              = "PT5M"
                }
              + scale_action {
                  + cooldown  = "PT5M"
                  + direction = "Increase"
                  + type      = "ChangeCount"
                  + value     = 2
                }
            }
          + rule {
              + metric_trigger {
                  + divide_by_instance_count = false
                  + metric_name              = "CpuPercentage"
                  + metric_namespace         = "microsoft.web/serverfarms"
                  + metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-ipatente-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-ipatente-payments-asp-01"
                  + operator                 = "LessThan"
                  + statistic                = "Average"
                  + threshold                = 30
                  + time_aggregation         = "Average"
                  + time_grain               = "PT1M"
                  + time_window              = "PT7M"
                }
              + scale_action {
                  + cooldown  = "PT5M"
                  + direction = "Decrease"
                  + type      = "ChangeCount"
                  + value     = 1
                }
            }
        }
    }

  # module.practices_app_service.module.practices_app_service_autoscaler.azurerm_monitor_autoscale_setting.this will be created
  + resource "azurerm_monitor_autoscale_setting" "this" {
      + enabled             = true
      + id                  = (known after apply)
      + location            = "italynorth"
      + name                = "io-p-itn-ipatente-practices-as-01"
      + resource_group_name = "io-p-itn-ipatente-rg-01"
      + tags                = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-ipatente/infra/prod"
        }
      + target_resource_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-ipatente-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-ipatente-practices-asp-01"

      + profile {
          + name = "Default"

          + capacity {
              + default = 3
              + maximum = 30
              + minimum = 3
            }

          + rule {
              + metric_trigger {
                  + divide_by_instance_count = true
                  + metric_name              = "Requests"
                  + metric_namespace         = "microsoft.web/sites"
                  + metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-ipatente-rg-01/providers/Microsoft.Web/sites/io-p-itn-ipatente-practices-app-01"
                  + operator                 = "GreaterThan"
                  + statistic                = "Average"
                  + threshold                = 3000
                  + time_aggregation         = "Average"
                  + time_grain               = "PT1M"
                  + time_window              = "PT1M"
                }
              + scale_action {
                  + cooldown  = "PT1M"
                  + direction = "Increase"
                  + type      = "ChangeCount"
                  + value     = 2
                }
            }
          + rule {
              + metric_trigger {
                  + divide_by_instance_count = true
                  + metric_name              = "Requests"
                  + metric_namespace         = "microsoft.web/sites"
                  + metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-ipatente-rg-01/providers/Microsoft.Web/sites/io-p-itn-ipatente-practices-app-01"
                  + operator                 = "LessThan"
                  + statistic                = "Average"
                  + threshold                = 2000
                  + time_aggregation         = "Average"
                  + time_grain               = "PT1M"
                  + time_window              = "PT7M"
                }
              + scale_action {
                  + cooldown  = "PT5M"
                  + direction = "Decrease"
                  + type      = "ChangeCount"
                  + value     = 1
                }
            }
          + rule {
              + metric_trigger {
                  + divide_by_instance_count = false
                  + metric_name              = "CpuPercentage"
                  + metric_namespace         = "microsoft.web/serverfarms"
                  + metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-ipatente-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-ipatente-practices-asp-01"
                  + operator                 = "GreaterThan"
                  + statistic                = "Average"
                  + threshold                = 60
                  + time_aggregation         = "Average"
                  + time_grain               = "PT1M"
                  + time_window              = "PT5M"
                }
              + scale_action {
                  + cooldown  = "PT5M"
                  + direction = "Increase"
                  + type      = "ChangeCount"
                  + value     = 2
                }
            }
          + rule {
              + metric_trigger {
                  + divide_by_instance_count = false
                  + metric_name              = "CpuPercentage"
                  + metric_namespace         = "microsoft.web/serverfarms"
                  + metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-ipatente-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-ipatente-practices-asp-01"
                  + operator                 = "LessThan"
                  + statistic                = "Average"
                  + threshold                = 30
                  + time_aggregation         = "Average"
                  + time_grain               = "PT1M"
                  + time_window              = "PT7M"
                }
              + scale_action {
                  + cooldown  = "PT5M"
                  + direction = "Decrease"
                  + type      = "ChangeCount"
                  + value     = 1
                }
            }
        }
    }

  # module.payments_app_service.module.payments_app_service_roles.module.key_vault.azurerm_role_assignment.secrets["io-p-itn-ipatente-rg-01|io-p-itn-ipatente-kv-01|reader"] will be created
  + resource "azurerm_role_assignment" "secrets" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "d6ef689d-6880-48e1-9ac9-f2f660aeee09"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-ipatente-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-ipatente-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.payments_app_service.module.payments_app_service_staging_roles.module.key_vault.azurerm_role_assignment.secrets["io-p-itn-ipatente-rg-01|io-p-itn-ipatente-kv-01|reader"] will be created
  + resource "azurerm_role_assignment" "secrets" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "f58befd2-263f-4b09-8113-5dc12690a2b5"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-ipatente-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-ipatente-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.practices_app_service.module.practices_app_service_roles.module.key_vault.azurerm_role_assignment.secrets["io-p-itn-ipatente-rg-01|io-p-itn-ipatente-kv-01|reader"] will be created
  + resource "azurerm_role_assignment" "secrets" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0948f259-ba39-432a-a9c2-ab41c676d6f1"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-ipatente-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-ipatente-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.practices_app_service.module.practices_app_service_staging_roles.module.key_vault.azurerm_role_assignment.secrets["io-p-itn-ipatente-rg-01|io-p-itn-ipatente-kv-01|reader"] will be created
  + resource "azurerm_role_assignment" "secrets" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "4f2fb3d1-dad1-43c1-998b-0b9bff910389"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-ipatente-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-ipatente-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
